using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class PlayerSkillInformation
{
    public static string[,,,] SKILLINFORMATIONS = {
        {
            {
                 { "+1攻", "+10%暴击伤害","持续时间+1"},
                 { "+1攻", "+10%暴击伤害","持续时间+1"},
                 { "+2攻", "+30%暴击伤害","结束后3s凝滞"},
                 { "使用该技能后本局内暴击率+10%","",""}
            },
            {
                 { "+1攻", "+10%暴击伤害","持续时间+1"},
                 { "+1攻", "+10%暴击伤害","持续时间+1"},
                 { "+2攻", "+30%暴击伤害","结束后3s凝滞"},
                 { "使用该技能后本局内暴击率+10%","",""}
            },
            {
                 { "+1攻", "+10%暴击伤害","持续时间+1"},
                 { "+1攻", "+10%暴击伤害","持续时间+1"},
                 { "+2攻", "+30%暴击伤害","结束后3s凝滞"},
                 { "使用该技能后本局内暴击率+10%","",""}
            },
            {
                 { "+1攻", "+10%暴击伤害","持续时间+1"},
                 { "+1攻", "+10%暴击伤害","持续时间+1"},
                 { "+2攻", "+30%暴击伤害","结束后3s凝滞"},
                 { "使用该技能后本局内暴击率+10%","",""}
            }
        },
        {
            {
                 { "血量+1", "物防+1","持续时间+1"},
                 { "血量+1", "物防+1","持续时间+1"},
                 { "血量+2", "物防+2","60%吸血"},
                 { "使用该技能后本局内血量+10%","",""}
            },
            {
                 { "血量+1", "物防+1","持续时间+1"},
                 { "血量+1", "物防+1","持续时间+1"},
                 { "血量+2", "物防+2","60%吸血"},
                 { "使用该技能后本局内血量+10%","",""}
            },
            {
                 { "血量+1", "物防+1","持续时间+1"},
                 { "血量+1", "物防+1","持续时间+1"},
                 { "血量+2", "物防+2","60%吸血"},
                 { "使用该技能后本局内血量+10%","",""}
            },
            {
                 { "血量+1", "物防+1","持续时间+1"},
                 { "血量+1", "物防+1","持续时间+1"},
                 { "血量+2", "物防+2","60%吸血"},
                 { "使用该技能后本局内血量+10%","",""}
            }
        },
        {
            {
                 { "+1移动速度", "+1攻击速度","持续时间+1"},
                 { "+1移动速度", "+1攻击速度","持续时间+1"},
                 { "+2移动速度", "+2攻击速度","跨地形行进"},
                 { "使用该技能后本局内移速+10%","",""}
            },
            {
                 { "+1移动速度", "+1攻击速度","持续时间+1"},
                 { "+1移动速度", "+1攻击速度","持续时间+1"},
                 { "+2移动速度", "+2攻击速度","跨地形行进"},
                 { "使用该技能后本局内移速+10%","",""}
            },
            {
                 { "+1移动速度", "+1攻击速度","持续时间+1"},
                 { "+1移动速度", "+1攻击速度","持续时间+1"},
                 { "+2移动速度", "+2攻击速度","跨地形行进"},
                 { "使用该技能后本局内移速+10%","",""}
            },
            {
                 { "+1移动速度", "+1攻击速度","持续时间+1"},
                 { "+1移动速度", "+1攻击速度","持续时间+1"},
                 { "+2移动速度", "+2攻击速度","跨地形行进"},
                 { "使用该技能后本局内移速+10%","",""}
            }
        }
        
    };
}
